 ### Terraform Component 🧱: `aws-analytical-platform-development-open-metadata`
#### Terraform Initialization ⚙️: `success`
#### Terraform Validation 🤖: `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Static Analysis 🛂

Checkov: `success`

tfsec: `success`

#### Terraform Plan 📖: `success`

<details><summary>Plan Output</summary>

```

Acquiring state lock. This may take a few moments...
random_password.opensearch_master_password: Refreshing state... [id=none]
random_password.openmetadata_airflow: Refreshing state... [id=none]
random_uuid.openmetadata_jwt: Refreshing state... [id=ca64a657-bc47-5d92-c9e9-420ce6edaf9a]
data.aws_caller_identity.session: Reading...
data.aws_caller_identity.session: Read complete after 0s [id=042130406152]
data.aws_iam_session_context.session: Reading...
data.aws_iam_session_context.session: Read complete after 0s [id=arn:aws:sts::042130406152:assumed-role/GlobalGitHubActionAccess/GitHubActions]
module.airflow_rds.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=openmetadata-airflow-20230628153724848400000002]
module.open_metadata_airflow_iam_role.data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.fargate_profile["jupyterhub"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["openmetadata"].data.aws_caller_identity.current: Reading...
module.load_balancer_controller_iam_role.data.aws_region.current: Reading...
module.open_metadata_airflow_iam_role.data.aws_region.current: Reading...
module.rds.module.db_instance.data.aws_partition.current: Reading...
module.airflow_rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=openmetadata-airflow-20230628153724847800000001]
module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.cluster_autoscaler_iam_role.data.aws_partition.current: Reading...
module.eks.module.fargate_profile["jupyterhub"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3016102342]
module.load_balancer_controller_iam_role.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.open_metadata_airflow_iam_role.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.rds.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=openmetadata-20230628105811740200000002]
module.cert_manager_iam_role.data.aws_region.current: Reading...
module.cluster_autoscaler_iam_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.open_metadata_iam_role.data.aws_caller_identity.current: Reading...
module.efs_csi_driver_iam_role.data.aws_caller_identity.current: Reading...
module.ebs_csi_driver_iam_role.data.aws_caller_identity.current: Reading...
module.cert_manager_iam_role.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.load_balancer_controller_iam_role.data.aws_caller_identity.current: Reading...
module.open_metadata_airflow_iam_role.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.eks.module.eks_managed_node_group["openmetadata"].data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.eks.module.eks_managed_node_group["openmetadata"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["openmetadata"].data.aws_partition.current: Read complete after 0s [id=aws]
module.rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=openmetadata-20230628105811740100000001]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.ebs_csi_driver_iam_role.data.aws_partition.current: Reading...
module.eks.module.fargate_profile["jupyterhub"].aws_iam_role.this[0]: Refreshing state... [id=jupyterhub-fargate-20230622162511097500000001]
module.ebs_csi_driver_iam_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.ebs_csi_driver_iam_role.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.cluster_autoscaler_iam_role.data.aws_caller_identity.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/open-metadata/cluster]
module.efs_csi_driver_iam_role.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.efs_csi_driver_iam_role.data.aws_iam_policy_document.efs_csi[0]: Reading...
module.efs_csi_driver_iam_role.data.aws_iam_policy_document.efs_csi[0]: Read complete after 0s [id=3064053908]
module.open_metadata_iam_role.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.open_metadata_iam_role.data.aws_region.current: Reading...
module.coder_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.open_metadata_iam_role.data.aws_region.current: Read complete after 0s [id=eu-west-2]
data.aws_caller_identity.current: Reading...
module.coder_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.coder_rds.module.db_instance.data.aws_partition.current: Reading...
module.coder_rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.load_balancer_controller_iam_role.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.efs_csi_driver_iam_role.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.efs_csi_driver_iam_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.module.fargate_profile["jupyterhub"].data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.fargate_profile["jupyterhub"].data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_iam_role.data.aws_partition.current: Reading...
module.external_dns_iam_role.data.aws_caller_identity.current: Reading...
module.external_dns_iam_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.ebs_csi_driver_iam_role.data.aws_region.current: Reading...
module.ebs_csi_driver_iam_role.data.aws_region.current: Read complete after 0s [id=eu-west-2]
aws_acm_certificate.datahub: Refreshing state... [id=arn:aws:acm:eu-west-2:525294151996:certificate/b5628544-cd60-4d96-b36c-a96465cc2393]
module.cluster_autoscaler_iam_role.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.eks.module.kms.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
data.aws_iam_policy_document.open_metadata_airflow: Reading...
data.aws_iam_policy_document.open_metadata_airflow: Read complete after 0s [id=3958173377]
module.cert_manager_iam_role.data.aws_caller_identity.current: Reading...
module.external_dns_iam_role.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.airflow_rds.module.db_instance.data.aws_partition.current: Reading...
module.airflow_rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.efs.aws_efs_file_system.this[0]: Refreshing state... [id=fs-07a3e4dcb3177856f]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
data.aws_secretsmanager_secret_version.open_metadata_client_id: Reading...
module.cert_manager_iam_role.data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.eks.module.fargate_profile["jupyterhub"].data.aws_caller_identity.current: Reading...
module.eks.module.fargate_profile["jupyterhub"].data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
module.open_metadata_airflow_iam_role.data.aws_partition.current: Reading...
module.open_metadata_airflow_iam_role.data.aws_partition.current: Read complete after 0s [id=aws]
aws_route53_zone.data_platform_moj_woffenden_dev: Refreshing state... [id=Z0071145I5MOYSFNGEEZ]
data.aws_secretsmanager_secret_version.open_metadata_tenant_id: Reading...
module.efs_csi_driver_iam_role.data.aws_region.current: Reading...
module.efs_csi_driver_iam_role.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.cluster_autoscaler_iam_role.data.aws_region.current: Reading...
module.cluster_autoscaler_iam_role.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.external_dns_iam_role.data.aws_region.current: Reading...
module.external_dns_iam_role.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08776fe59faa43d98]
module.load_balancer_controller_iam_role.data.aws_partition.current: Reading...
module.load_balancer_controller_iam_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.cert_manager_iam_role.data.aws_partition.current: Reading...
module.cert_manager_iam_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.airflow_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.airflow_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.open_metadata_iam_role.data.aws_partition.current: Reading...
module.open_metadata_iam_role.data.aws_partition.current: Read complete after 0s [id=aws]
aws_acm_certificate.open_metadata: Refreshing state... [id=arn:aws:acm:eu-west-2:525294151996:certificate/4cc75030-97f9-4673-9739-b944ec3b3ff8]
data.aws_secretsmanager_secret_version.open_metadata_client_id: Read complete after 0s [id=open-metadata/azure/clientid|AWSCURRENT]
module.eks.module.eks_managed_node_group["openmetadata"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["openmetadata"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 1s [id=arn:aws:sts::525294151996:assumed-role/GlobalGitHubActionAdmin/aws-go-sdk-1689863892468881537]
module.efs_csi_driver_iam_role.aws_iam_policy.efs_csi[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/AmazonEKS_EFS_CSI_Policy-20230621095658191100000001]
module.eks.module.eks_managed_node_group["openmetadata"].aws_iam_role.this[0]: Refreshing state... [id=openmetadata-eks-node-group-20230628220741415600000001]
data.aws_secretsmanager_secret_version.open_metadata_tenant_id: Read complete after 1s [id=open-metadata/azure/tenantid|AWSCURRENT]
module.ebs_csi_driver_iam_role.data.aws_iam_policy_document.ebs_csi[0]: Reading...
module.ebs_csi_driver_iam_role.data.aws_iam_policy_document.ebs_csi[0]: Read complete after 0s [id=932695789]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.open_metadata_airflow_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/open-metadata-airflow20230627222243159700000001]
module.load_balancer_controller_iam_role.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...
module.load_balancer_controller_iam_role.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 0s [id=3014472196]
module.ebs_csi_driver_iam_role.aws_iam_policy.ebs_csi[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/AmazonEKS_EBS_CSI_Policy-20230621112521460400000002]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=open-metadata-cluster-20230620155159768300000004]
module.eks.module.fargate_profile["jupyterhub"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=jupyterhub-fargate-20230622162511097500000001-20230622162512327600000004]
module.eks.module.fargate_profile["jupyterhub"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=jupyterhub-fargate-20230622162511097500000001-20230622162512146000000003]
module.load_balancer_controller_iam_role.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/AmazonEKS_AWS_Load_Balancer_Controller-20230621165910115000000002]
module.efs.aws_efs_access_point.this["airflow_dags"]: Refreshing state... [id=fsap-0aef1f93505030aed]
module.efs.aws_efs_backup_policy.this[0]: Refreshing state... [id=fs-07a3e4dcb3177856f]
module.efs.aws_efs_access_point.this["airflow_logs"]: Refreshing state... [id=fsap-06642f099a2d97cbe]
aws_route53_record.datahub["datahub.data-platform.moj.woffenden.dev"]: Refreshing state... [id=Z0071145I5MOYSFNGEEZ__6579a495a6bfe0bd880da683b556617c.datahub.data-platform.moj.woffenden.dev._CNAME]
module.cert_manager_iam_role.data.aws_iam_policy_document.cert_manager[0]: Reading...
module.cert_manager_iam_role.data.aws_iam_policy_document.cert_manager[0]: Read complete after 0s [id=3554444127]
module.external_dns_iam_role.data.aws_iam_policy_document.external_dns[0]: Reading...
module.external_dns_iam_role.data.aws_iam_policy_document.external_dns[0]: Read complete after 0s [id=4171235161]
module.eks.module.eks_managed_node_group["openmetadata"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=openmetadata-eks-node-group-20230628220741415600000001-20230628220742386700000002]
module.eks.module.eks_managed_node_group["openmetadata"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=openmetadata-eks-node-group-20230628220741415600000001-20230628220742679700000005]
module.eks.module.eks_managed_node_group["openmetadata"].aws_iam_role_policy_attachment.additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=openmetadata-eks-node-group-20230628220741415600000001-20230628220742666600000004]
module.eks.module.eks_managed_node_group["openmetadata"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=openmetadata-eks-node-group-20230628220741415600000001-20230628220742525100000003]
module.cert_manager_iam_role.aws_iam_policy.cert_manager[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/AmazonEKS_Cert_Manager_Policy-20230621155918039100000001]
module.external_dns_iam_role.aws_iam_policy.external_dns[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/AmazonEKS_External_DNS_Policy-20230621161421392300000001]
aws_route53_record.open_metadata["open-metadata.data-platform.moj.woffenden.dev"]: Refreshing state... [id=Z0071145I5MOYSFNGEEZ__c11506c347ef1cc7d9ef6562084121dd.open-metadata.data-platform.moj.woffenden.dev._CNAME]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=open-metadata-cluster-20230620155159768300000004-20230620155201136200000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=open-metadata-cluster-20230620155159768300000004-20230620155201126800000008]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3877540961]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=62d7e75c-d854-4761-9a2a-d5187fb37338]
aws_acm_certificate_validation.datahub: Refreshing state... [id=2023-06-22 15:44:43.58 +0000 UTC]
aws_acm_certificate_validation.open_metadata: Refreshing state... [id=2023-06-21 18:35:34.089 +0000 UTC]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/open-metadata]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/open-metadata-cluster-ClusterEncryption2023062015522985730000000a]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=open-metadata-cluster-20230620155159768300000004-2023062015523041710000000b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-03f87c8cfcae47cda]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01e4ff41f014f542b]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d84523f5a224bdef]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0a54a361d8816273b]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0edb4e8192e04c4d9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a3faec66103d8e37]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0b0900d8a0f1014eb]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-007c9f6f777123756]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ad77064e4d51f87b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0e1398b6adb7ff094]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0b69e4ff78eb4a024]
module.opensearch_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07292001b795a74dd]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03075ca41c61b4ad1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a316a54d21d73bfe]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-064aac147b8b7a404]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0b83f45f5126f2d92]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-043bb79ae9c9adefc]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c357ece15044e17b]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0d97b15c763dfc86a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08400ed95030116d8]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-047921319c4f388c2]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-089b6bd21d94f6038]
module.vpc.aws_subnet.elasticache[0]: Refreshing state... [id=subnet-085979bb4ec575b7c]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0147b561e5a7823b6]
module.vpc.aws_subnet.elasticache[1]: Refreshing state... [id=subnet-003d869fd975bcb1e]
module.vpc.aws_subnet.elasticache[2]: Refreshing state... [id=subnet-0c7251f801982179b]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0b879aed1278556ed]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-0df1114f0b6036729]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-038725ce1e3a80ebc]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0c8cdc7a8f0d00700]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0bdb7208c912c3903]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-03d548de483d786b2]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=open-metadata]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-00ac1f2dbaa4759bc]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-06e04ef64f7ab16fd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-045e1fc9577b05fce]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04f3d8fdb1b48a6e7]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f5029e31437fa2ad]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d481a83520424891]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c357ece15044e17b1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0211c89e54320fab0]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08eaeaa7a05ca9689]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1560104214]
module.opensearch_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-549795915]
module.vpc.aws_route_table_association.elasticache[0]: Refreshing state... [id=rtbassoc-0b6865fd75299a146]
module.vpc.aws_elasticache_subnet_group.elasticache[0]: Refreshing state... [id=open-metadata]
aws_opensearch_domain.openmetadata: Refreshing state... [id=arn:aws:es:eu-west-2:525294151996:domain/openmetadata]
module.vpc.aws_route_table_association.elasticache[1]: Refreshing state... [id=rtbassoc-0af1fe16b9f196990]
module.vpc.aws_route_table_association.elasticache[2]: Refreshing state... [id=rtbassoc-01f5bc788c0b5d8bf]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-086fce850f493dd84]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-031f0c56c00328f24]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0cc5df581d6426137]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3028019128]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1906116557]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1509165996]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2988498312]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1252538253]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-270812247]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-772342854]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2427874362]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1105385885]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3955006286]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0b74a969c15eec6e9]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3034179502]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-00f157616d1c173fb]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-006c3a55567ef5189]
module.efs.aws_security_group.this[0]: Refreshing state... [id=sg-09cdee82ed8e3c123]
module.rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-DRKH2KGYSYIXC3T2JZZK4EJT3Y]
module.airflow_rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-QXRQ5T4W56LLM7BC4V2JCX4SLM]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0e1398b6adb7ff0941080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0b69e4ff78eb4a0241080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-007c9f6f7771237561080289494]
module.efs.aws_efs_mount_target.this["private-subnets-0"]: Refreshing state... [id=fsmt-0cd19728bd4a6c28d]
module.efs.aws_efs_mount_target.this["private-subnets-1"]: Refreshing state... [id=fsmt-0e08b4ee8de7df2a9]
module.efs.aws_efs_mount_target.this["private-subnets-2"]: Refreshing state... [id=fsmt-032aec18f5d97660f]
module.efs.aws_security_group_rule.this["vpc"]: Refreshing state... [id=sgrule-3688718616]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=open-metadata]
data.aws_secretsmanager_secret_version.openmetadata_rds_credentials: Reading...
data.aws_iam_policy_document.opensearch_domain: Reading...
data.aws_iam_policy_document.opensearch_domain: Read complete after 0s [id=2016555158]
aws_opensearch_domain_policy.openmetadata: Refreshing state... [id=esd-policy-openmetadata]
data.aws_secretsmanager_secret_version.openmetadata_airflow_rds_credentials: Reading...
data.aws_secretsmanager_secret_version.openmetadata_rds_credentials: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-2:525294151996:secret:rds!db-75d4a9aa-d7c9-4992-bf44-93fc658ee7a7-vjXUDk|AWSCURRENT]
data.aws_secretsmanager_secret_version.openmetadata_airflow_rds_credentials: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-2:525294151996:secret:rds!db-5cf2a9f4-656e-43dc-bf22-2b78bc990bb2-rDjvKI|AWSCURRENT]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2023-06-20T16:01:01Z]
module.cluster_autoscaler_iam_role.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.cluster_autoscaler_iam_role.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=4004569972]
module.cluster_autoscaler_iam_role.aws_iam_policy.cluster_autoscaler[0]: Refreshing state... [id=arn:aws:iam::525294151996:policy/AmazonEKS_Cluster_Autoscaler_Policy-20230622215449273600000001]
module.eks.module.fargate_profile["jupyterhub"].aws_eks_fargate_profile.this[0]: Refreshing state... [id=open-metadata:jupyterhub]
module.eks.module.eks_managed_node_group["openmetadata"].aws_launch_template.this[0]: Refreshing state... [id=lt-03539530216cc9951]
kubernetes_persistent_volume.airflow_dags: Refreshing state... [id=openmetadata-dependencies-dags-pv]
kubernetes_namespace.jupyterhub: Refreshing state... [id=jupyterhub]
kubernetes_persistent_volume.airflow_logs: Refreshing state... [id=openmetadata-dependencies-logs-pv]
kubernetes_namespace.external_dns: Refreshing state... [id=external-dns]
kubernetes_namespace.open_metadata: Refreshing state... [id=open-metadata]
kubernetes_storage_class.efs: Refreshing state... [id=efs-sc]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=17bd96401642e610ba843d6cef08c95bfb79f46c]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::525294151996:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/296807A4C0FC1B3F2FD8A51FA26211C6]
module.eks.module.eks_managed_node_group["openmetadata"].aws_eks_node_group.this[0]: Refreshing state... [id=open-metadata:openmetadata-20230628220743106200000008]
module.external_dns_iam_role.data.aws_iam_policy_document.this[0]: Reading...
module.cert_manager_iam_role.data.aws_iam_policy_document.this[0]: Reading...
module.external_dns_iam_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3666876719]
module.cert_manager_iam_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4221463530]
module.ebs_csi_driver_iam_role.data.aws_iam_policy_document.this[0]: Reading...
module.cluster_autoscaler_iam_role.data.aws_iam_policy_document.this[0]: Reading...
module.cluster_autoscaler_iam_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2434826760]
module.ebs_csi_driver_iam_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=375339702]
module.efs_csi_driver_iam_role.data.aws_iam_policy_document.this[0]: Reading...
module.load_balancer_controller_iam_role.data.aws_iam_policy_document.this[0]: Reading...
module.efs_csi_driver_iam_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2286352504]
module.load_balancer_controller_iam_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2340605450]
module.cert_manager_iam_role.aws_iam_role.this[0]: Refreshing state... [id=cert-manager20230621155918039300000002]
module.external_dns_iam_role.aws_iam_role.this[0]: Refreshing state... [id=external-dns20230621161421392500000002]
module.cluster_autoscaler_iam_role.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler20230622215449273700000002]
module.ebs_csi_driver_iam_role.aws_iam_role.this[0]: Refreshing state... [id=ebs-csi-driver20230621112521458200000001]
module.efs_csi_driver_iam_role.aws_iam_role.this[0]: Refreshing state... [id=efs-csi-driver20230621163500499900000001]
module.load_balancer_controller_iam_role.aws_iam_role.this[0]: Refreshing state... [id=load-balancer-controller20230621165910114100000001]
module.external_dns_iam_role.aws_iam_role_policy_attachment.external_dns[0]: Refreshing state... [id=external-dns20230621161421392500000002-20230621161422559600000003]
module.cert_manager_iam_role.aws_iam_role_policy_attachment.cert_manager[0]: Refreshing state... [id=cert-manager20230621155918039300000002-20230621155919214900000003]
module.cluster_autoscaler_iam_role.aws_iam_role_policy_attachment.cluster_autoscaler[0]: Refreshing state... [id=cluster-autoscaler20230622215449273700000002-20230622215450487100000003]
helm_release.external_dns: Refreshing state... [id=external-dns]
module.ebs_csi_driver_iam_role.aws_iam_role_policy_attachment.ebs_csi[0]: Refreshing state... [id=ebs-csi-driver20230621112521458200000001-20230621112522559100000004]
helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.efs_csi_driver_iam_role.aws_iam_role_policy_attachment.efs_csi[0]: Refreshing state... [id=efs-csi-driver20230621163500499900000001-20230621163501607200000002]
helm_release.cluster_autoscaler: Refreshing state... [id=cluster-autoscaler]
module.load_balancer_controller_iam_role.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=load-balancer-controller20230621165910114100000001-20230621165911147600000003]
helm_release.aws_efs_csi_driver: Refreshing state... [id=aws-efs-csi-driver]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
kubernetes_secret.openmetadata_airflow_rds_credentials: Refreshing state... [id=open-metadata/openmetadata-airflow-rds-credentials]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
kubernetes_secret.openmetadata_airflow: Refreshing state... [id=open-metadata/airflow-secrets]
kubernetes_secret.openmetadata_rds_credentials: Refreshing state... [id=open-metadata/openmetadata-rds-credentials]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
kubernetes_persistent_volume_claim.airflow_dags: Refreshing state... [id=open-metadata/openmetadata-dependencies-dags-pvc]
kubernetes_secret.openmetadata_opensearch: Refreshing state... [id=open-metadata/opensearch-credentials]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
kubernetes_persistent_volume_claim.airflow_logs: Refreshing state... [id=open-metadata/openmetadata-dependencies-logs-pvc]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.open_metadata_iam_role.data.aws_iam_policy_document.this[0]: Reading...
module.open_metadata_iam_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=119222341]
module.open_metadata_airflow_iam_role.data.aws_iam_policy_document.this[0]: Reading...
module.open_metadata_airflow_iam_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3851535850]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=open-metadata:vpc-cni]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=open-metadata:aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=open-metadata:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=open-metadata:kube-proxy]
module.open_metadata_iam_role.aws_iam_role.this[0]: Refreshing state... [id=open-metadata20230621212626444300000001]
module.open_metadata_airflow_iam_role.aws_iam_role.this[0]: Refreshing state... [id=open-metadata-airflow20230623105404064900000001]
module.open_metadata_airflow_iam_role.aws_iam_role_policy_attachment.this["open-metadata-airflow"]: Refreshing state... [id=open-metadata-airflow20230623105404064900000001-20230627222439164100000001]
helm_release.openmetadata_dependencies: Refreshing state... [id=openmetadata-dependencies]
kubernetes_manifest.cert_manager_cluster_issuers: Refreshing state...
helm_release.openmetadata: Refreshing state... [id=openmetadata]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.efs.aws_efs_file_system.this[0] has changed
  ~ resource "aws_efs_file_system" "this" {
        id                              = "fs-07a3e4dcb3177856f"
      ~ size_in_bytes                   = [
          ~ {
              ~ value             = 596912128 -> 605878272
              ~ value_in_standard = 596912128 -> 605878272
                # (1 unchanged attribute hidden)
            },
        ]
        tags                            = {
            "Name" = "open-metadata"
        }
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_secretsmanager_secret_version.coder_rds_credentials will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "coder_rds_credentials" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_acm_certificate.coder will be created
  + resource "aws_acm_certificate" "coder" {
      + arn                       = (known after apply)
      + domain_name               = "coder.data-platform.moj.woffenden.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "coder.data-platform.moj.woffenden.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "coder.data-platform.moj.woffenden.dev",
        ]
      + tags_all                  = {
          + "application"            = "Data Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "Open Metadata"
          + "environment"            = "development"
          + "infrastructure-support" = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/data-platform"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # kubernetes_namespace.coder will be created
  + resource "kubernetes_namespace" "coder" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "coder"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.coder_rds_connection_url will be created
  + resource "kubernetes_secret" "coder_rds_connection_url" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "coder-rds-connection-url"
          + namespace        = "coder"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.coder_rds.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "coder"
      + db_subnet_group_name                  = "open-metadata"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "coder"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.medium"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 20
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "application"            = "Data Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "Open Metadata"
          + "environment"            = "development"
          + "infrastructure-support" = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/data-platform"
        }
      + timezone                              = (known after apply)
      + username                              = "coder"
      + vpc_security_group_ids                = [
          + "sg-0d97b15c763dfc86a",
        ]

      + timeouts {}
    }

  # module.coder_rds.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "coder parameter group"
      + family      = "postgres14"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "coder-"
      + tags        = {
          + "Name" = "coder"
        }
      + tags_all    = {
          + "Name"                   = "coder"
          + "application"            = "Data Platform"
          + "business-unit"          = "Platforms"
          + "component"              = "Open Metadata"
          + "environment"            = "development"
          + "infrastructure-support" = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "is-production"          = "false"
          + "owner"                  = "data-platform:data-platform-tech@digital.justice.gov.uk"
          + "source-code"            = "github.com/ministryofjustice/data-platform"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.eks.aws_eks_addon.this["vpc-cni"],
  on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
 392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")

The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
resource creation. Use "resolve_conflicts_on_create" and/or
"resolve_conflicts_on_update" instead

(and 3 more similar warnings elsewhere)
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @jacobwoffenden, Action: `pull_request`, Working Directory: `terraform/aws/analytical-platform-development/open-metadata`, Workflow: `Terraform`*